﻿let sourceGrammar = `﻿<програма>::= program IDN <список_огол1> begin <список_опер1> end
<список_огол1>::= <список_огол>
<список_огол>::= <оголошення> П | <список_огол> <оголошення> П
<оголошення>::= <тип> <список_ід1>
<тип>::= int
<список_ід1>::= <список_ід>
<список_ід>::= @ IDN | <список_ід> , @ IDN
<список_опер1>::= <список_опер>
<список_опер>::= <опер1> П | <список_опер> <опер1> П
<опер1>::= <опер>
<опер>::= <виведення> | <введення> | <присвоєння> | <цикл> | <ум_перехід>
<присвоєння>::= IDN = <вираз1>
<виведення>::= in ( <список_ід1> )
<введення>::= out ( <список_ід1> )
<ум_перехід>::= if <лог_вираз1>  <список_опер1> else <список_опер1> endif
<цикл>::= for IDN = <вираз1> to <вираз1> step do <список_опер1> next
<лог_вираз1>::= <лог_вираз>
<лог_вираз>::= <лог_терм1> | <лог_вираз> or <лог_терм1>
<лог_терм1>::= <лог_терм>
<лог_терм>::= <лог_мн1> | <лог_терм> && <лог_мн1>
<лог_мн1>::= <лог_мн>
<лог_мн>::= <відн> | [ <лог_вираз1> ] | ! <лог_мн>
<відн>::= <вираз1> <зн_відн> <вираз1>
<зн_відн>::= < | > | == | <= | >= | !=
<вираз1>::= <вираз>
<вираз>::= <терм1> | <вираз> + <терм1> | <вираз> - <терм1>
<терм1>::= <терм>
<терм>::= <мн1> | <терм> * <мн1> | <терм> / <мн1>
<мн1>::= <мн>
<степінь>::= <мн> | <мн> ^ <степінь>
<мн>::= IDN | CON | ( <вираз1> )`;